Revit 2027 API
AnalyticalBusData.TotalConnectedCurrent Property
 The total connected current of the analytical bus.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TotalConnectedCurrent { get; }
Public ReadOnly Property TotalConnectedCurrent As Double
	Get
public:
property double TotalConnectedCurrent {
	double get ();
}
member TotalConnectedCurrent : float with get
Property Value
Double
See Also
Reference
AnalyticalBusData Class
Autodesk.Revit.DB.Electrical Namespace